app/Models/Model_siakad.php

    function mahasiswa()
    {
        // $sql = "SELECT * FROM mahasiswa";
        // $hsl = $this->db->query($sql)->getResult();
        // return $hsl;

        //untuk mengambil data dari tabel
        // $dapatkan = $this->db->table('mahasiswa')->get();
        // $hsl = $dapatkan->getResult();
        // return $hsl;

        //inner join SQL
        // $sql = "SELECT mahasiswa. *, prodi.prodi FROM mahasiswa INNER JOIN prodi ON mahasiswa.kode = prodi.kode";
        // $hsl = $this->db->query($sql)->getResult();
        // return $hsl;

        //Inner join codeingnater
        $builder = $this->db->table('mahasiswa');
        $builder->select('*');
        $builder->join('prodi', 'prodi.kode = mahasiswa.kode');
        $query = $builder->get();
---
SELECT *
FROM `mahasiswa`
JOIN `prodi` ON `prodi`.`kode` = `mahasiswa`.`kode`